## Plan 📝
```bash
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/apsitvarkom-staging/locations/us-east1/repositories/docker-apsitvarkom-staging]
google_storage_bucket.terraform_state_bucket: Refreshing state... [id=apsitvarkom-staging-bucket-tfstate]
google_service_account.postgresql_vm_account: Refreshing state... [id=projects/apsitvarkom-staging/serviceAccounts/postgresql-vm@apsitvarkom-staging.iam.gserviceaccount.com]
google_service_account.ga_cd_account: Refreshing state... [id=projects/apsitvarkom-staging/serviceAccounts/ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_compute_instance.postgresql: Refreshing state... [id=projects/apsitvarkom-staging/zones/us-east1-b/instances/postgresql]
google_project_iam_member.cloud_run_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/run.admin/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.service_account_user_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/iam.serviceAccountUser/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.artifact_registry_repo_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/artifactregistry.repoAdmin/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.token_creator_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/iam.serviceAccountTokenCreator/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_firewall.all_to_postgresql will be created
  + resource "google_compute_firewall" "all_to_postgresql" {
      + creation_timestamp = (known after apply)
      + description        = "Firewall rule to allow cloud run services to communicate with PostgreSQL VM"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "all-to-postgresql"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "postgresql",
        ]

      + allow {
          + ports    = [
              + "5432",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.postgresql will be updated in-place
  ~ resource "google_compute_instance" "postgresql" {
        id                      = "projects/apsitvarkom-staging/zones/us-east1-b/instances/postgresql"
      ~ metadata                = {
          - "ssh-keys" = <<-EOT
                bud_benas:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBFNavvD0nIDu1o5PHzelptVU6B5TPi5+sTE5sRvXXLeI9BoxtJTfc1O1KOUF12tK2kOO2/k4nlh9yOJ3+oZEXio= google-ssh {"userName":"bud.benas@gmail.com","expireOn":"2022-11-06T16:12:47+0000"}
                bud_benas:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAHjd0Xo/9Ye2GdPZD8bm9fSvkMMNH8cB14KDRJRssWxFkbMu4RLB/oFg8QZUl55beSAW2UqF0gmRbi8gCrH/eqH91HutGT7z8WHnssUe/nwq74RN0fy19793ttol+gRE3JAivGwjobUpgSpx///Ax8QrqQZ3Kjkp91WlBytuOOmaioeRpd6/5tOwwYJM9NMrKttqkVeUktrSiL1kO2Vl72eKseUj6Mjmnxz/RTvE25Si2s8s7an2/ehV2EYb0RMxqkoe5WLMJsGIGxHatJdGq2orieeIsxeost4BAesJXB66TpRmB/wm+vLRV+CS/hYrRcZENQjchpE7NrfvmKWcv6s= google-ssh {"userName":"bud.benas@gmail.com","expireOn":"2022-11-06T16:13:04+0000"}
            EOT -> null
        }
        name                    = "postgresql"
        tags                    = [
            "postgresql",
        ]
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentplan -->